In [2]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd
import warnings
warnings.simplefilter('ignore')

In [4]:
bank_df = pd.read_csv(r"C:\Users\omkar\OneDrive\Desktop\Datasets\bank_transaction1.csv")

In [6]:
df = bank_df.copy()

In [7]:
df.head()

,TransactionID,CustomerID,CustomerDOB,CustGender,CustLocation,CustAccountBalance,TransactionDate,TransactionTime,TransactionAmount (INR)
0,T950255,C8211536,15/4/94,M,GURGAON,6054.68,10/9/16,204205,230.0
1,T348456,C1724521,11/7/88,F,EAST GODAVARI,650.38,15/8/16,130839,50.0
2,T179226,C7711118,28/2/88,M,OFFICE PURBA MEDINIPUR,9246.98,4/8/16,220538,100.0
3,T37509,C2240753,13/8/73,M,CHENNAI,57806.21,27/9/16,90913,563.0
4,T473137,C5248755,29/9/68,M,RAJKOT,1044669.31,21/8/16,183050,44.0

In [10]:
df.shape

(1000, 9)

In [11]:
# It has 1000 rows and 9 columns

In [12]:
df.CustomerID.nunique()

1000

In [13]:
# we will drop TransactionID and CustomerID column because each row is unique so that there is no pattern.

In [14]:
df.drop(columns=['TransactionID','CustomerID'],inplace=True)

In [15]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 7 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   CustomerDOB              997 non-null    object
 1   CustGender               999 non-null    object
 2   CustLocation             1000 non-null   object
 3   CustAccountBalance       998 non-null    float64
 4   TransactionDate          1000 non-null   object
 5   TransactionTime          1000 non-null   int64
 6   TransactionAmount (INR)  1000 non-null   float64
dtypes: float64(2), int64(1), object(4)
memory usage: 54.8+ KB

In [17]:
# Convert the columns into proper formats

In [18]:
df.rename(columns= {'TransactionAmount (INR)':'TransactionAmount'},inplace=True)

In [20]:
df['CustomerDOB']  = pd.to_datetime(df['CustomerDOB'],errors = 'raise')

In [32]:
# pd.set_option('display.max_rows',None)
pd.reset_option('display.max_rows')

In [37]:
df['TransactionDate']  = pd.to_datetime(df['TransactionDate'],errors = 'raise')

In [42]:
df['TransactionDate'].dt.year.nunique()

1

In [ ]:
#2016 is the only one year which is available as the trasaction date, So Considering 2016 year is the buiding or analysis for this dataset.

In [43]:
df[df['CustomerDOB'].dt.year > 2016]

,CustomerDOB,CustGender,CustLocation,CustAccountBalance,TransactionDate,TransactionTime,TransactionAmount
3,2073-08-13,M,CHENNAI,57806.21,2016-09-27,90913,563.00
4,2068-09-29,M,RAJKOT,1044669.31,2016-08-21,183050,44.00
14,2072-01-13,M,MOHALI,22944.74,2016-07-08,214807,159.00
48,2073-06-08,F,NEW DELHI,2666636.12,2016-08-17,114805,698.01
61,2070-12-14,M,KOLKATA,97419.89,2016-05-08,120359,7590.00
...,...,...,...,...,...,...,...
946,2073-05-10,M,DELHI,230615.89,2016-12-08,131638,235.13
960,2047-03-29,M,KASHIPUR,27748.51,2016-08-18,181758,1518.00
969,2062-09-04,M,CHENNAI,20130.13,2016-09-13,231732,1091.00
973,2066-08-10,M,GURGAON,723124.40,2016-01-08,105653,568.00
998,2068-01-13,F,GURGAON,38457.11,2016-08-24,193729,2594.78

In [36]:
# 83 rows are considered as data entry errors as per customer DOB,Considering age as the important feature for the clustering in this case.
# Since we don't have correct data for the data entry errors will drop these rows further.

In [47]:
df['TransactionTime'] = pd.to_datetime(df['TransactionTime'].astype(str).str.zfill(6), format='%H%M%S').dt.time

In [49]:
# df.drop(columns=['Formatted_Time'],inplace=True)

In [50]:
df.head()

,CustomerDOB,CustGender,CustLocation,CustAccountBalance,TransactionDate,TransactionTime,TransactionAmount
0,1994-04-15,M,GURGAON,6054.68,2016-10-09,20:42:05,230.0
1,1988-11-07,F,EAST GODAVARI,650.38,2016-08-15,13:08:39,50.0
2,1988-02-28,M,OFFICE PURBA MEDINIPUR,9246.98,2016-04-08,22:05:38,100.0
3,2073-08-13,M,CHENNAI,57806.21,2016-09-27,09:09:13,563.0
4,2068-09-29,M,RAJKOT,1044669.31,2016-08-21,18:30:50,44.0

In [52]:
df.any()==' '

CustomerDOB           False
CustGender            False
CustLocation          False
CustAccountBalance    False
TransactionDate       False
TransactionTime       False
TransactionAmount     False
dtype: bool

In [53]:
# Entire dataset does't have empty strings

In [63]:
df.isnull().sum()

CustomerDOB           3
CustGender            1
CustLocation          0
CustAccountBalance    2
TransactionDate       0
TransactionTime       0
TransactionAmount     0
dtype: int64